org/Dynamic_causal_modelling_of_COVID-19_by_Karl_Friston,_Thomas_Parr,_Jean_Daunizeau,_Rosalyn_Moran,_et_al_in_2020.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Dynamic_causal_modelling_of_COVID-19_by_Karl_Friston,_Thomas_Parr,_Jean_Daunizeau,_Rosalyn_Moran,_et_al_in_2020
#+TITLE: Dynamic causal modelling of COVID-19 by Karl Friston, Thomas Parr, Jean Daunizeau, Rosalyn Moran, et al in 2020
* [[file:papers.org][papers]], [[file:dynamic_causal_modeling.org][dynamic causal modeling]], [[file:Karl_Friston.org][Karl Friston]] 
* [[file:code_repository.org][code repository]]
** The figures in these manuscripts can be reproduced using annotated code.
** The data used in the manuscripts are available from the [[https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_time_series][Center for Systems Science and Engineering (CSSE) at Johns Hopkins University]]. The CSV files have to be available from the MATLAB path.
** https://github.com/RosalynMoran/Covid-19
** https://github.com/spm/spm12
* This technical report describes a dynamic causal model of the spread of coronavirus through a population. The model is based upon ensemble or population dynamics that generate outcomes, like new cases and deaths over time. The purpose of this model is to quantify the uncertainty that attends predictions of relevant outcomes.__ — via [[https://www.fil.ion.ucl.ac.uk/spm/covid-19/][Dynamic Causal Modelling of COVID-19]]
* Introduction
** Dynamic causal modelling (DCM) refers to the characterisation of coupled dynamical systems in terms of how observable data are generated by unobserved (i.e., latent or hidden) causes 
*** (Friston et al., 2003; Moran et al., 2013).
**** Friston, K.J., Harrison, L., Penny, W., 2003. Dynamic causal modelling. NeuroImage 19, 1273-1302.
**** Moran, R., Pinotsis, D.A., Friston, K., 2013. Neural masses and fields in dynamic causal modeling. Frontiers in computational neuroscience 7, 57.
*** **Dynamic causal modelling** subsumes 
**** **state estimation** and 
**** **system identification** 
*** under one Bayesian procedure, to provide probability densities over
******unknown latent states (i.e., state estimation)** and 
**** **model parameters (i.e., system identification)**, 
*** respectively. Its **focus** is on **estimating the uncertainty about these estimates** to **quantify the evidence for competing models**, and the **confidence in various predictions.**
* The generative model
** Transition probabilities and priors
** Initial conditions
** The likelihood model
* Bayesian model comparison
* Parametric empirical Bayes and hierarchical models
* Dynamic causal modeling of a single country
* Predictive validity
* Conclusions
* related [[file:references.org][references]]
** [[file:DEM_A_variational_treatment_of_dynamic_systems_by_Karl_Friston_and_J_Daunizeau_in_2008.org][DEM A variational treatment of dynamic systems by Karl Friston and J Daunizeau in 2008]]
