content/posts/Dynamic_causal_modelling_of_COVID-19_by_Karl_Friston,_Thomas_Parr,_Jean_Daunizeau,_Rosalyn_Moran,_et_al_in_2020.md
+++
title = "Dynamic causal modelling of COVID-19 by Karl Friston, Thomas Parr, Jean Daunizeau, Rosalyn Moran, et al in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-24T22:26:58-04:00
slug = "Dynamic_causal_modelling_of_COVID-19_by_Karl_Friston,_Thomas_Parr,_Jean_Daunizeau,_Rosalyn_Moran,_et_al_in_2020"
draft = false
+++

## [papers]({{< relref "papers" >}}), [dynamic causal modeling]({{< relref "dynamic_causal_modeling" >}}), [Karl Friston]({{< relref "Karl_Friston" >}}) {#papers--papers-dot-md--dynamic-causal-modeling--dynamic-causal-modeling-dot-md--karl-friston--karl-friston-dot-md}


## [code repository]({{< relref "code_repository" >}}) {#code-repository--code-repository-dot-md}


### The figures in these manuscripts can be reproduced using annotated code. {#the-figures-in-these-manuscripts-can-be-reproduced-using-annotated-code-dot}


### The data used in the manuscripts are available from the [Center for Systems Science and Engineering (CSSE) at Johns Hopkins University](https://github.com/CSSEGISandData/COVID-19/tree/master/csse%5Fcovid%5F19%5Fdata/csse%5Fcovid%5F19%5Ftime%5Fseries). The CSV files have to be available from the MATLAB path. {#the-data-used-in-the-manuscripts-are-available-from-the-center-for-systems-science-and-engineering--csse--at-johns-hopkins-university-dot-the-csv-files-have-to-be-available-from-the-matlab-path-dot}


### <https://github.com/RosalynMoran/Covid-19> {#https-github-dot-com-rosalynmoran-covid-19}


### <https://github.com/spm/spm12> {#https-github-dot-com-spm-spm12}


## This technical report describes a dynamic causal model of the spread of coronavirus through a population. The model is based upon ensemble or population dynamics that generate outcomes, like new cases and deaths over time. The purpose of this model is to quantify the uncertainty that attends predictions of relevant outcomes.\_\_ — via [Dynamic Causal Modelling of COVID-19](https://www.fil.ion.ucl.ac.uk/spm/covid-19/) {#this-technical-report-describes-a-dynamic-causal-model-of-the-spread-of-coronavirus-through-a-population-dot-the-model-is-based-upon-ensemble-or-population-dynamics-that-generate-outcomes-like-new-cases-and-deaths-over-time-dot-the-purpose-of-this-model-is-to-quantify-the-uncertainty-that-attends-predictions-of-relevant-outcomes-dot-via-dynamic-causal-modelling-of-covid-19}


## Introduction {#introduction}


### Dynamic causal modelling (DCM) refers to the characterisation of coupled dynamical systems in terms of how observable data are generated by unobserved (i.e., latent or hidden) causes {#dynamic-causal-modelling--dcm--refers-to-the-characterisation-of-coupled-dynamical-systems-in-terms-of-how-observable-data-are-generated-by-unobserved--i-dot-e-dot-latent-or-hidden--causes}

<!--list-separator-->

-  (Friston et al., 2003; Moran et al., 2013).

    <!--list-separator-->

    -  Friston, K.J., Harrison, L., Penny, W., 2003. Dynamic causal modelling. NeuroImage 19, 1273-1302.

    <!--list-separator-->

    -  Moran, R., Pinotsis, D.A., Friston, K., 2013. Neural masses and fields in dynamic causal modeling. Frontiers in computational neuroscience 7, 57.

<!--list-separator-->

-  ****Dynamic causal modelling**** subsumes

    <!--list-separator-->

    -  ****state estimation**** and

    <!--list-separator-->

    -  ****system identification****

<!--list-separator-->

-  under one Bayesian procedure, to provide probability densities over

    ****\*\*\*\*unknown latent states (i.e., state estimation)**** and

    <!--list-separator-->

    -  ****model parameters (i.e., system identification)****,

<!--list-separator-->

-  respectively. Its ****focus**** is on ****estimating the uncertainty about these estimates**** to ****quantify the evidence for competing models****, and the ****confidence in various predictions.****


## The generative model {#the-generative-model}


### Transition probabilities and priors {#transition-probabilities-and-priors}


### Initial conditions {#initial-conditions}


### The likelihood model {#the-likelihood-model}


## Bayesian model comparison {#bayesian-model-comparison}


## Parametric empirical Bayes and hierarchical models {#parametric-empirical-bayes-and-hierarchical-models}


## Dynamic causal modeling of a single country {#dynamic-causal-modeling-of-a-single-country}


## Predictive validity {#predictive-validity}


## Conclusions {#conclusions}


## related [references]({{< relref "references" >}}) {#related-references--references-dot-md}


### [DEM A variational treatment of dynamic systems by Karl Friston and J Daunizeau in 2008]({{< relref "DEM_A_variational_treatment_of_dynamic_systems_by_Karl_Friston_and_J_Daunizeau_in_2008" >}}) {#dem-a-variational-treatment-of-dynamic-systems-by-karl-friston-and-j-daunizeau-in-2008--dem-a-variational-treatment-of-dynamic-systems-by-karl-friston-and-j-daunizeau-in-2008-dot-md}
